**free


    dcl-pr sqlsrv1;
        p_lib                     char(10) const;
        p_srcpf                   char(10) const;
        p_sqlcode                 int(10);
        p_msg                     char(200);
    end-pr;
