     A          R FILE1R
     A            SP1           10A         COLHDG('Spalte 1')
     A            SP2           10A         COLHDG('Spalte 2')
